---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointIterator.Dispose
source: html/753a660a-67db-6d9f-0beb-2e62e0a700ee.htm
---
# Autodesk.Revit.DB.PointClouds.PointIterator.Dispose Method

Releases all resources used by the PointIterator

## Syntax (C#)
```csharp
public void Dispose()
```